In [2]:
import pandas as pd
from io import StringIO

In [17]:

csv_data = \
            '''A,B,C,D
            1.0,2.0,3.0,4.0
            5.0,6.0,,8.0
            10.0,11.0,12.0,'''
# >>> # If you are using Python 2.7, you need
# >>> # to convert the string to unicode:
# >>> # csv_data = unicode(csv_data)
df = pd.read_csv(StringIO(csv_data))
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

In [4]:
df_nulls = df.isnull().sum(axis=0)
df_nulls

A    0
B    0
C    1
D    1
dtype: int64

In [5]:
df_nulls = df.isnull().sum(axis=1)
df_nulls

0    0
1    1
2    1
dtype: int64

In [6]:
df.values

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6., nan,  8.],
       [10., 11., 12., nan]])

In [7]:
df.to_numpy()

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6., nan,  8.],
       [10., 11., 12., nan]])

In [8]:
df.values[1,1] = 6.2

In [9]:
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.2   NaN  8.0
2  10.0  11.0  12.0  NaN

In [10]:
df.dropna(axis=0, how='all')

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.2   NaN  8.0
2  10.0  11.0  12.0  NaN

In [11]:
df.dropna(axis=0, how='any')

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [12]:
df.dropna(axis=1, how='any')

      A     B
0   1.0   2.0
1   5.0   6.2
2  10.0  11.0

In [13]:
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.2   NaN  8.0
2  10.0  11.0  12.0  NaN

In [15]:
# Simple mean imputation
from sklearn.impute import SimpleImputer
import numpy as np

imr = SimpleImputer(missing_values=np.nan, strategy='mean')
imr = imr.fit(df.values)
imputed_data = imr.transform(df.values)
df_imputed_data1 = pd.DataFrame(imputed_data)
df_imputed_data1

      0     1     2    3
0   1.0   2.0   3.0  4.0
1   5.0   6.2   7.5  8.0
2  10.0  11.0  12.0  6.0

In [16]:
# Equivalent to...
df_imputed_data2 = df.fillna(df.mean())
df_imputed_data2

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.2   7.5  8.0
2  10.0  11.0  12.0  6.0